<template>
	<article class="article" v-if="article.id === 1">
		<img
			v-if="article.image"
			class="article__main-image"
			:src="article.image"
			alt="Изображение связанное со статьей"
		/>
		<h1 class="article__title">{{ article.title }}</h1>
    <section class="intro intro__article">
      <p class="intro__text">
			Сказать сейчас, что мы мы живём в век информации - по сути, не
			сказать ничего. Это непреложная истина по умолчанию. Потребление
			информации – жизненно необходимый аспект в наши дни. Необходимость
			её получения для современного человека сопоставима с потребностью в
			воде и в свете.<br />
			Информации сейчас предостаточно, даже в избытке. Но на её анализ и
			обработку нужно время, которого у делового человека, как правило,
			нет. Только чёткая структуризация информации способна сделать её
			усвоение максимально результативным при минимальных временных
			затратах. А оптимизация временных ресурсов – один из важнейших
			аспектов в любом бизнесе. Поэтому пасринг стал неотъемлемой
			составляющей в деловых кругах.
		</p>
    </section>
		<section class="about-parsing about-parsing__article">
			<h2 class="about-parsing__title">
				Что такое парсинг информации в открытых источниках?
			</h2>
			<p class="about-parsing__explain">
				Парсинг – автоматизированный сбор информации с её последующей
				систематизацией и подачей в структурированном виде. Проще
				говоря, подборка готовых предложений в соответствии с вашими
				запросами. Вопросы, на которые, в конечном итоге, должны быть
				получены ответы в результате парсинга: кто, что, где и за
				сколько продаёт.
			</p>
			<ul class="parsing-spheres">
				<li class="parsing-sphere parsing-sphere__parsing-spheres">
					<h3 class="parsing-sphere__title">
						1. Ценовая разведка.
					</h3>
					<p class="parsing-sphere__text">
						Для понимания средней стоимости товаров и услуг, их
						ассортимента, количества продаж незаменимым является
						использование данных по конкурентам. А это сотни,
						тысячи, а иногда и сотни тысяч позиций. Быстрый сбор и
						обработка такого количества данных в ручном режиме
						просто невозможны. Без парсинга здесь не обойтись.
					</p>
				</li>
				<li class="parsing-sphere parsing-sphere__parsing-spheres">
					<h3 class="parsing-sphere__title">
						2. Парсинг досок объявлений для сбора баз контактов.
					</h3>
					<p class="parsing-sphere__text">
						Любое объявление о продаже товаров или услуг
						подразумевает наличие контактного телефона продавца для
						связи с ним и последующего обсуждения деталей сделки.
						Соответсвенно, контакты тоже являются объектом парсинга.
						Рассмотрим правовой аспект данной манипуляции.
					</p>
					<p class="parsing-sphere__text">
						Многие настроены скептически по отношению к парсингу, а
						некоторые (из-за незнания), мягко говоря, сильно
						сомневаются в его законности. Давайте разберёмся не
						выходит ли парсинг за рамки закона? Парсинг – это
						автоматизированный сбор информации из открытых (!)
						источников. Т.е. полученная информация является
						общедоступной.
					</p>
					<p class="parsing-sphere__text">
						Как трактует понятие «общедоступная» ныне действующее
						законодательство? П.1 ст.7 Федерального закона «Об
						информации, информационных технологиях и о защите
						информации» от 27.07.2006 №149-ФЗ (ред. от 03.04.2020)
						гласит:
						<span class="parsing-sphere__text_style_italic"
							>К общедоступной информации относятся общеизвестные
							сведения и иная информация, доступ к которой не
							ограничен.
						</span>
					</p>
					<p class="parsing-sphere__text">
						Если применить эту выдержку к теме нашего обсуждения –
						информация с контактами с досок объявлений, размещённая
						на сайте в свободном доступе (с соблюдением ограничений,
						установленных законом на её распространение), является
						общедоступной.
					</p>
					<p class="parsing-sphere__text">
						Осталось разобраться со свободным использованием и
						передачей информации другому лицу. Как данные действия
						регулирует закон? Обратимся к п.1 ст.5 того же самого
						закона. Читаем:
						<span class="parsing-sphere__text_style_italic"
							>Информация может являться объектом публичных,
							гражданских, и иных правовых отношений. Информация
							может свободно использоваться любым лицом и
							передаваться одним лицом другому лицу, если
							федеральными законами не установлены ограничения
							доступа к информации, либо иные требования к порядку
							её предоставления или распространения.
						</span>
					</p>
					<p class="parsing-sphere__text">
						Подытожив вышеизложенное, резюмируем: получение
						общедоступной информации и передача её другим лицам
						абсолютно законна и никак не нарушает действующее
						законодательство.
					</p>
				</li>
				<li class="parsing-sphere parsing-sphere__parsing-spheres">
					<h3 class="parsing-sphere__title">
						3. Парсинг контента с заданных сайтов с целью получения
						свежей информации или генерации нового контента.
					</h3>
					<p class="parsing-sphere__text">
						Каждый, наверняка, слышал изречение:
					</p>
					<div class="quote">
						<p class="quote__text">
							«Кто владеет информацией – тот владеет миром»
						</p>
						<p class="quote__author">
							Натан Ротшильд, банкир, основатель английской ветви
							банковской династии Ротшильдов
						</p>
						<img
							class="quote__image"
							src="https://upload.wikimedia.org/wikipedia/commons/5/55/1st_Baron_Rothschild.jpg"
							alt="Фото Натана Ротшильда"
						/>
					</div>
					<p class="parsing-sphere__text">
						Ставшая крылатой фраза, не теряет актуальности и по сей
						день.
					</p>
					<p class="parsing-sphere__text">
						Многие профессии связаны с получением и обработкой
						больших объёмов информации. А в цифровую эпоху их
						количество только стремительно увеличивается. Да и для
						простого обывателя информация является важным и
						необходимым условием для полноценного пребывания в
						современном социуме. Каждый уважающий себя человек
						испытывает потребность быть информированным и иметь хотя
						бы общие представления о происходящем в окружающей его
						действительности.
					</p>
					<p class="parsing-sphere__text">
						Парсинг новостных лент сделает возможным получение
						только нужной, интересной и актуальной для Вас
						информации.
					</p>
				</li>
			</ul>
		</section>
		<section class="compas-pro-info">
			<p class="compas-pro-info__text">
				Информация и потребность в её регулярном получении и
				структуризации в современном мире, претерпевающим тотальную
				цифровизацию, стали объективными субстанциями нашей реальности.
			</p>
			<p class="compas-pro-info__text">
				Но одна и та же информация для представителей различных
				социальных групп имеет разную ценность, в зависимости от
				профессии, увлечений, мировоззрения в целом и т.д.
			</p>
			<p class="compas-pro-info__text">
				Разработки сотрудников «Compass Guru» позволят удовлетворить
				любые запросы и интересы, вне зависимости от рода деятельности,
				будь то покупка товаров или услуг, поиск вакансий или получение
				информации и выдача новостей определённой тематики, в
				соответствии с индивидуальными заданными критериями поиска,
				избавив Вас от необходимости блуждания по информационным
				лабиринтам, увеличив тем самым производительность труда и
				подарив свободное время, которое Вы можете потратить на общение
				с близкими, свои увлечения, хобби, в общем распорядиться им в
				своё удовольствие. Присоединяйтесь к сообществу быстро
				получающих нужную информацию людей! Тратьте время с
				удовольствием!
				<a
					class="compas-pro-info__link"
					href="https://telegram.im/@compas_gooru"
					target="_blank"
					>Свяжитесь с нами через Telegram - канал</a
				>
			</p>
		</section>
	</article>
  <article class="article" v-else-if="article.id === 2">
		<img
			v-if="article.image"
			class="article__main-image"
			:src="article.image"
			alt="Изображение связанное со статьей"
		/>
		<h1 class="article__title">{{ article.title }}</h1>
		<p class="article__intro">
			Сказать сейчас, что мы мы живём в век информации - по сути, не
			сказать ничего. Это непреложная истина по умолчанию. Потребление
			информации – жизненно необходимый аспект в наши дни. Необходимость
			её получения для современного человека сопоставима с потребностью в
			воде и в свете.<br />
			Информации сейчас предостаточно, даже в избытке. Но на её анализ и
			обработку нужно время, которого у делового человека, как правило,
			нет. Только чёткая структуризация информации способна сделать её
			усвоение максимально результативным при минимальных временных
			затратах. А оптимизация временных ресурсов – один из важнейших
			аспектов в любом бизнесе. Поэтому пасринг стал неотъемлемой
			составляющей в деловых кругах.
		</p>
		<section class="about-parsing">
			<h2 class="about-parsing__subtitle">
				Что такое парсинг информации в открытых источниках?
			</h2>
			<p class="about-parsing__explain">
				Парсинг – автоматизированный сбор информации с её последующей
				систематизацией и подачей в структурированном виде. Проще
				говоря, подборка готовых предложений в соответствии с вашими
				запросами. Вопросы, на которые, в конечном итоге, должны быть
				получены ответы в результате парсинга: кто, что, где и за
				сколько продаёт.
			</p>
			<ul class="parsing-spheres">
				<li class="parsing-sphere parsing-sphere__parsing-spheres">
					<h3 class="parsing-sphere__title">
						1. Ценовая разведка.
					</h3>
					<p class="parsing-sphere__text">
						Для понимания средней стоимости товаров и услуг, их
						ассортимента, количества продаж незаменимым является
						использование данных по конкурентам. А это сотни,
						тысячи, а иногда и сотни тысяч позиций. Быстрый сбор и
						обработка такого количества данных в ручном режиме
						просто невозможны. Без парсинга здесь не обойтись.
					</p>
				</li>
				<li class="parsing-sphere parsing-sphere__parsing-spheres">
					<h3 class="parsing-sphere__title">
						2. Парсинг досок объявлений для сбора баз контактов.
					</h3>
					<p class="parsing-sphere__text">
						Любое объявление о продаже товаров или услуг
						подразумевает наличие контактного телефона продавца для
						связи с ним и последующего обсуждения деталей сделки.
						Соответсвенно, контакты тоже являются объектом парсинга.
						Рассмотрим правовой аспект данной манипуляции.
					</p>
					<p class="parsing-sphere__text">
						Многие настроены скептически по отношению к парсингу, а
						некоторые (из-за незнания), мягко говоря, сильно
						сомневаются в его законности. Давайте разберёмся не
						выходит ли парсинг за рамки закона? Парсинг – это
						автоматизированный сбор информации из открытых (!)
						источников. Т.е. полученная информация является
						общедоступной.
					</p>
					<p class="parsing-sphere__text">
						Как трактует понятие «общедоступная» ныне действующее
						законодательство? П.1 ст.7 Федерального закона «Об
						информации, информационных технологиях и о защите
						информации» от 27.07.2006 №149-ФЗ (ред. от 03.04.2020)
						гласит:
						<span class="parsing-sphere__text_style_italic"
							>К общедоступной информации относятся общеизвестные
							сведения и иная информация, доступ к которой не
							ограничен.
						</span>
					</p>
					<p class="parsing-sphere__text">
						Если применить эту выдержку к теме нашего обсуждения –
						информация с контактами с досок объявлений, размещённая
						на сайте в свободном доступе (с соблюдением ограничений,
						установленных законом на её распространение), является
						общедоступной.
					</p>
					<p class="parsing-sphere__text">
						Осталось разобраться со свободным использованием и
						передачей информации другому лицу. Как данные действия
						регулирует закон? Обратимся к п.1 ст.5 того же самого
						закона. Читаем:
						<span class="parsing-sphere__text_style_italic"
							>Информация может являться объектом публичных,
							гражданских, и иных правовых отношений. Информация
							может свободно использоваться любым лицом и
							передаваться одним лицом другому лицу, если
							федеральными законами не установлены ограничения
							доступа к информации, либо иные требования к порядку
							её предоставления или распространения.
						</span>
					</p>
					<p class="parsing-sphere__text">
						Подытожив вышеизложенное, резюмируем: получение
						общедоступной информации и передача её другим лицам
						абсолютно законна и никак не нарушает действующее
						законодательство.
					</p>
				</li>
				<li class="parsing-sphere parsing-sphere__parsing-spheres">
					<h3 class="parsing-sphere__title">
						3. Парсинг контента с заданных сайтов с целью получения
						свежей информации или генерации нового контента.
					</h3>
					<p class="parsing-sphere__text">
						Каждый, наверняка, слышал изречение:
					</p>
					<div class="quote">
						<p class="quote__text">
							«Кто владеет информацией – тот владеет миром»
						</p>
						<p class="quote__author">
							Натан Ротшильд, банкир, основатель английской ветви
							банковской династии Ротшильдов
						</p>
						<img
							class="quote__image"
							src="https://upload.wikimedia.org/wikipedia/commons/5/55/1st_Baron_Rothschild.jpg"
							alt="Фото Натана Ротшильда"
						/>
					</div>
					<p class="parsing-sphere__text">
						Ставшая крылатой фраза, не теряет актуальности и по сей
						день.
					</p>
					<p class="parsing-sphere__text">
						Многие профессии связаны с получением и обработкой
						больших объёмов информации. А в цифровую эпоху их
						количество только стремительно увеличивается. Да и для
						простого обывателя информация является важным и
						необходимым условием для полноценного пребывания в
						современном социуме. Каждый уважающий себя человек
						испытывает потребность быть информированным и иметь хотя
						бы общие представления о происходящем в окружающей его
						действительности.
					</p>
					<p class="parsing-sphere__text">
						Парсинг новостных лент сделает возможным получение
						только нужной, интересной и актуальной для Вас
						информации.
					</p>
				</li>
			</ul>
		</section>
		<section class="compas-pro-info">
			<p class="compas-pro-info__text">
				Информация и потребность в её регулярном получении и
				структуризации в современном мире, претерпевающим тотальную
				цифровизацию, стали объективными субстанциями нашей реальности.
			</p>
			<p class="compas-pro-info__text">
				Но одна и та же информация для представителей различных
				социальных групп имеет разную ценность, в зависимости от
				профессии, увлечений, мировоззрения в целом и т.д.
			</p>
			<p class="compas-pro-info__text">
				Разработки сотрудников «Compass Guru» позволят удовлетворить
				любые запросы и интересы, вне зависимости от рода деятельности,
				будь то покупка товаров или услуг, поиск вакансий или получение
				информации и выдача новостей определённой тематики, в
				соответствии с индивидуальными заданными критериями поиска,
				избавив Вас от необходимости блуждания по информационным
				лабиринтам, увеличив тем самым производительность труда и
				подарив свободное время, которое Вы можете потратить на общение
				с близкими, свои увлечения, хобби, в общем распорядиться им в
				своё удовольствие. Присоединяйтесь к сообществу быстро
				получающих нужную информацию людей! Тратьте время с
				удовольствием!
				<a
					class="compas-pro-info__link"
					href="https://telegram.im/@compas_gooru"
					target="_blank"
					>Свяжитесь с нами через Telegram - канал</a
				>
			</p>
		</section>
	</article>
</template>

<script>
	// пока что компонент написан на жестком харде, до появляения текстового редактора
	//import { h } from '@vue/runtime-core'
	export default {
		/* render() {
    
    return h('div', { class: 'article' }, [
      this.article.image ? h('img', { class: 'article__image', src: this.article.image }) : '',
      h('h1', { class: 'article__title' }, this.article.title),
    ] )
  }, */
		name: "TheArticle",
		props: {
			article: {
				type: Object,
				required: true,
			},
		},
	};
</script>

<style lang="scss" scoped>
@import "@/assets/scss/variables";
	.article {
		display: flex;
		flex-direction: column;

		&__main-image {
			width: 100%;
      border-radius: 1rem;
      margin-bottom: 3rem;
		}
    &__title {
      font-size: 5.4rem;
      font-weight: 500;
      margin-bottom: 5rem;
    }
	}
  .intro {
    padding: 0;
    &__article {
      margin-bottom: 4rem;
    }
    &__text {
      font-size: 2.4rem;
      line-height: 1.5;
      margin-bottom: 3rem;
      &:last-child {
        margin-bottom: 0;
      }
    }
  }
  .about-parsing {
    padding: 0;
    &__aricle {
      margin-bottom: 4rem;
    }
    &__title {
      font-size: 3.6rem;
      font-weight: 500;
      margin-bottom: 3rem;
    }
    &__explain {
      font-size: 2.4rem;
      line-height: 1.5;
      margin-bottom: 3rem;
      &:last-child {
        margin-bottom: 0;
      }
    }
  }
  .parsing-sphere {
    display: flex;
    flex-direction: column;
    &__parsing-spheres {
      margin-bottom: 3rem;
      &:last-child {
        margin-bottom: 0;
      }
    }
    &__title {
      font-size: 3rem;
      font-weight: 500;
      margin-bottom: 3rem;
    }
    &__text {
      font-size: 2.4rem;
			line-height: 1.5;
      margin-bottom: 3.5rem;
			&:last-child {
        margin-bottom: 0;
      }
    }
  }
	.quote{
		display: grid;
		grid-gap: 3rem 5rem;
		grid-template-rows: repeat(2, minmax(auto, max-content));
		max-width: 100%;

		&__text {
			font-size: 3rem;
			font-weight: 300;
			font-style: italic;
			color: $gray;
			grid-column: 1/2;
			align-self: end;
		}
		&__author {
			font-size: 3rem;
			line-height: 1.5;
			font-style: italic;
			color: $black;
			grid-column: 1/2;
		}
		&__image {
			border-radius: 50%;
			max-width: 200px;
			max-height: 200px;
			grid-column: 2/3;
			grid-row: 1/3;
		}
	}
</style>
