<template>
	<article class="article" v-if="article.id === 1">
		<img
			v-if="article.image"
			class="article__main-image"
			:src="article.image"
			alt="Изображение связанное со статьей"
		/>
		<h1 class="article__title">{{ article.title }}</h1>
		<section class="section article__section">
			<p class="section__text">
				Сказать сейчас, что мы мы живём в век информации - по сути, не
				сказать ничего. Это непреложная истина по умолчанию. Потребление
				информации – жизненно необходимый аспект в наши дни.
				Необходимость её получения для современного человека сопоставима
				с потребностью в воде и в свете.<br />
				Информации сейчас предостаточно, даже в избытке. Но на её анализ
				и обработку нужно время, которого у делового человека, как
				правило, нет. Только чёткая структуризация информации способна
				сделать её усвоение максимально результативным при минимальных
				временных затратах. А оптимизация временных ресурсов – один из
				важнейших аспектов в любом бизнесе. Поэтому пасринг стал
				неотъемлемой составляющей в деловых кругах.
			</p>
		</section>
		<section class="section article__section">
			<h2 class="section__title">
				Что такое парсинг информации в открытых источниках?
			</h2>
			<p class="section__text">
				Парсинг – автоматизированный сбор информации с её последующей
				систематизацией и подачей в структурированном виде. Проще
				говоря, подборка готовых предложений в соответствии с вашими
				запросами. Вопросы, на которые, в конечном итоге, должны быть
				получены ответы в результате парсинга: кто, что, где и за
				сколько продаёт.
			</p>
			<ul class="list">
				<li class="list-item list__list-item">
					<h3 class="list-item__title">1. Ценовая разведка.</h3>
					<p class="list-item__text">
						Для понимания средней стоимости товаров и услуг, их
						ассортимента, количества продаж незаменимым является
						использование данных по конкурентам. А это сотни,
						тысячи, а иногда и сотни тысяч позиций. Быстрый сбор и
						обработка такого количества данных в ручном режиме
						просто невозможны. Без парсинга здесь не обойтись.
					</p>
				</li>
				<li class="list-item list__list-item">
					<h3 class="list-item__title">
						2. Парсинг досок объявлений для сбора баз контактов.
					</h3>
					<p class="list-item__text">
						Любое объявление о продаже товаров или услуг
						подразумевает наличие контактного телефона продавца для
						связи с ним и последующего обсуждения деталей сделки.
						Соответсвенно, контакты тоже являются объектом парсинга.
						Рассмотрим правовой аспект данной манипуляции.
					</p>
					<p class="list-item__text">
						Многие настроены скептически по отношению к парсингу, а
						некоторые (из-за незнания), мягко говоря, сильно
						сомневаются в его законности. Давайте разберёмся не
						выходит ли парсинг за рамки закона? Парсинг – это
						автоматизированный сбор информации из открытых (!)
						источников. Т.е. полученная информация является
						общедоступной.
					</p>
					<p class="list-item__text">
						Как трактует понятие «общедоступная» ныне действующее
						законодательство?
					</p>
					<div class="acent-block section__acent-block">
						П.1 ст.7 Федерального закона «Об информации,
						информационных технологиях и о защите информации» от
						27.07.2006 №149-ФЗ (ред. от 03.04.2020) гласит: К
						общедоступной информации относятся общеизвестные
						сведения и иная информация, доступ к которой не
						ограничен.
					</div>
					<p class="list-item__text">
						Если применить эту выдержку к теме нашего обсуждения –
						информация с контактами с досок объявлений, размещённая
						на сайте в свободном доступе (с соблюдением ограничений,
						установленных законом на её распространение), является
						общедоступной.
					</p>
					<p class="list-item__text">
						Осталось разобраться со свободным использованием и
						передачей информации другому лицу. Как данные действия
						регулирует закон?
					</p>

					<div class="acent-block section__acent-block">
						П.1 ст.5 того же самого закона. Читаем: Информация может
						являться объектом публичных, гражданских, и иных
						правовых отношений. Информация может свободно
						использоваться любым лицом и передаваться одним лицом
						другому лицу, если федеральными законами не установлены
						ограничения доступа к информации, либо иные требования к
						порядку её предоставления или распространения.
					</div>

					<p class="list-item__text">
						Подытожив вышеизложенное, резюмируем: получение
						общедоступной информации и передача её другим лицам
						абсолютно законна и никак не нарушает действующее
						законодательство.
					</p>
				</li>
				<li class="list-item list__list-item">
					<h3 class="list-item__title">
						3. Парсинг контента с заданных сайтов с целью получения
						свежей информации или генерации нового контента.
					</h3>
					<!-- <div class="quote section__quote">
						<p class="quote__text">
							«Кто владеет информацией – тот владеет миром»
						</p>
						<p class="quote__author">
							Натан Ротшильд, банкир, основатель английской ветви
							банковской династии Ротшильдов
						</p>
						<img
							class="quote__image"
							src="https://upload.wikimedia.org/wikipedia/commons/5/55/1st_Baron_Rothschild.jpg"
							alt="Фото Натана Ротшильда"
						/>
					</div> -->
					<blockquote class="quote section__quote">
						<p class="quote__text">
							«Кто владеет информацией – тот владеет миром»
						</p>
						<cite class="quote__cite">&mdash; Натан Ротшильд</cite>
					</blockquote>
					<p class="list-item__text">
						Многие профессии связаны с получением и обработкой
						больших объёмов информации. А в цифровую эпоху их
						количество только стремительно увеличивается. Да и для
						простого обывателя информация является важным и
						необходимым условием для полноценного пребывания в
						современном социуме. Каждый уважающий себя человек
						испытывает потребность быть информированным и иметь хотя
						бы общие представления о происходящем в окружающей его
						действительности.
					</p>
					<p class="list-item__text">
						Парсинг новостных лент сделает возможным получение
						только нужной, интересной и актуальной для Вас
						информации.
					</p>
					<digest-card class="list__digest-card" />
				</li>
			</ul>
		</section>
		<section class="section">
			<p class="section__text">
				Информация и потребность в её регулярном получении и
				структуризации в современном мире, претерпевающим тотальную
				цифровизацию, стали объективными субстанциями нашей реальности.
			</p>
			<p class="section__text">
				Но одна и та же информация для представителей различных
				социальных групп имеет разную ценность, в зависимости от
				профессии, увлечений, мировоззрения в целом и т.д.
			</p>
			<p class="section__text">
				Разработки сотрудников «Compass Gooru» позволят удовлетворить
				любые запросы и интересы, вне зависимости от рода деятельности,
				будь то покупка товаров или услуг, поиск вакансий или получение
				информации и выдача новостей определённой тематики, в
				соответствии с индивидуальными заданными критериями поиска,
				избавив Вас от необходимости блуждания по информационным
				лабиринтам, увеличив тем самым производительность труда и
				подарив свободное время, которое Вы можете потратить на общение
				с близкими, свои увлечения, хобби, в общем распорядиться им в
				своё удовольствие. Присоединяйтесь к сообществу быстро
				получающих нужную информацию людей! Тратьте время с
				удовольствием!
				<a
					class="section__link"
					href="https://telegram.im/@compas_gooru"
					target="_blank"
					>Свяжитесь с нами через Telegram - канал
					<span class="section__link section__link_arrow"
						>&rarr;</span
					></a
				>
			</p>
		</section>
	</article>

	<article class="article" v-if="article.id === 2">
		<img
			v-if="article.image"
			class="article__main-image"
			:src="article.image"
			alt="Изображение связанное со статьей"
		/>
		<h1 class="article__title">{{ article.title }}</h1>
		<p class="article__subtitle">
			О появлении и развитии, сферах применения, главных плюсах, удобстве
			использования компьютерных систем – в нашей новой статье.
		</p>
		<section class="section article__section">
			<h2 class="section__title">Что такое искусственный интеллект?</h2>
			<p class="section__text">
				Точного определения этому понятию нет. Если говорить простым
				языком, искусственный интеллект — это способность компьютера
				решать задачи, свойственные человеку. Этот термин обычно
				используют, когда говорят об умении размышлять, учиться и
				использовать полученные знания.
			</p>
		</section>
		<section class="section article__section">
			<div class="group section__group">
				<h2 class="group__title">
					Назад в прошлое: создание умной машины
				</h2>
				<p class="group__text">
					В основе создания первой умной машины лежит теория Лейбница
					о «механизации человеческой мысли по принципу нервной
					системы человека на основе нейронных связей». В 1943 году
					американские ученые Уолтер Питтс и Уоррен Маккаллок
					предложили модель переноса информации – математический
					нейрон Маккалока – Питса.
				</p>
			</div>
			<div class="group section__group">
				<h2 class="group__title">Возникновение кибернетики</h2>
				<p class="group__text">
					Искусственного интеллекта не существовало бы без
					кибернетики, которая появилась как наука в 1948 году.
					Изучает управление и передачу информации в машинах и живых
					организмах с помощью алгоритмов. В 1956 в Дартмуте прошла
					конференция, посвящённая изучению «механизации» интеллекта.
					На семинаре присутствовал Джон Маккарти, который придумал
					название « Искусственный интеллект». Участники согласились с
					этим термином, и этот день стал Днем рождения искусственного
					интеллекта.
				</p>
			</div>
			<div class="group section__group">
				<h2 class="group__title">Роботы-помощники</h2>
				<p class="group__text">
					В 1965 году был разработан первый робот-помощник,
					разговаривающий на английском языке. «Элиза» считается
					прообразом современной Siri. В 1973 году была изобретена
					«Стэндфордская тележка». Это первый беспилотный автомобиль,
					контролируемый компьютером. В 1980 году японцы разработали
					робот Wabot-2, который общался с людьми, читал партитуры,
					играл на органе.
				</p>
			</div>
			<div class="group section__group">
				<h2 class="group__title">
					Обновление нейронных сетей и появление новых технологий
				</h2>
				<p class="group__text">
					В 1982 году ученый Джон Хопфилд создал новую форму нейронной
					сети, способную обрабатывать информацию. ИИ стал
					использоваться в «экспертных системах» (системах, обладающих
					глубоким знанием конкретной темы).
				</p>
				<p class="group__text">
					Благодаря новым технологиям в 1990-х годах утвердилась
					концепция «интеллектуальный агент». Это система выполняла
					задание, выданное пользователем, в течение длительных
					промежутков времени.
					<br />
					В 1997 году создали шахматную программу – компьютер «Дип
					Блю». Программа обыграла чемпиона мира по шахматам Гарри
					Каспарова.
					<br />
					А в 2005 году Стэнфорд разработал робота для автономного
					вождения. Он проехал 211 км по неизученной пустынной тропе.
				</p>
			</div>

			<div class="group section__group">
				<h2 class="section__title">
					Где сейчас применяется искусственный интеллект?
				</h2>
				<p class="group__text">
					Сейчас он используется везде, где нужно обрабатывать большие
					объемы информации, анализировать полученные данные и давать
					прогнозы. Искусственный интеллект постепенно проникает во
					все сферы. Давайте приведем несколько примеров, чтобы лучше
					разобраться в этой теме.
				</p>
				<p class="group__text">
					Медицина и здравоохранение. Компьютерные информационные
					системы распознают патологии на снимках узи и рентгена,
					выявляют заболевания крови по анализу, оценивают влияние
					медикаментов на организм пациента.
					<br />
					Есть болезни, которые долгие годы не дают о себе знать.
					Например, разновидности рака, ВИЧ-инфекция, деменция. Их
					нельзя вылечить, но благодаря искусственному интеллекту
					можно выявить на ранней стадии, облегчить их протекание.
				</p>
				<p class="group__text">
					Большой плюс компьютерных систем в том, что они могут
					анализировать огромный объем информации и ставить точные
					диагнозы. Когда лечит врач, обычный человек, чаще всего он
					не запоминает объемную историю болезни пациента, в которой
					обычно нет четкой структуры. Также врачу для правильного
					выявления диагноза может не хватать знаний в отличие от
					искусственного интеллекта.
				</p>
			</div>

			<div class="group section__group">
				<h2 class="group__title">Сельское хозяйство.</h2>
				<p class="group__text">
					Многим может показаться, что эта сфера далека от современных
					технологий, но это не так. В хозяйствах искусственный
					интеллект используют, чтобы выявлять сорняки, вредителей,
					болезни растений, подсчитывать урожай. Также с его помощью
					удобно отслеживать поведение животных и контролировать
					движение пастбищ.
				</p>
				<p class="group__text">
					Для наглядности приведем несколько примеров. Видеокамеры
					фиксируют поведение животных, а искусственный интеллект при
					получении данных определяет, более животное или нет. Также
					камеры могут фиксировать рождение детёнышей (телят, жеребят,
					ягнят и т.д.) и оповещать об этом сотрудников/жителей фермы.
					Таким образом, компьютерные информационные системы помогают
					людям, чтобы те, в свою очередь, быстро пришли на помощь
					животным, обеспечили уход и сохранили им здоровье.
				</p>
				<p class="group__text">
					Необходимо отдельно сказать, что в сельском хозяйстве люди
					начинают использовать новые информационные технологии. Пусть
					это происходит не во всех регионах и хозяйствах нашей
					страны, но обе сферы (IT и сельское хозяйство) стремительно
					развиваются и шагают вперед.
				</p>
			</div>
			<div class="group section__group">
				<h2 class="group__title">Логистика и транспорт.</h2>
				<p class="group__text">
					Информационные системы выстраивают для каждого клиента самый
					быстрый и удобный маршрут, прогнозируют задержки во время
					перевозок и рассчитывают бюджет.
				</p>
				<p class="group__text">
					Стоит отдельно сказать о беспилотных автомобилях. Благодаря
					внедрению искусственного интеллекта обеспечена безопасность
					и снижена вероятность возникновения аварий. Так происходит
					вследствие алгоритмов, которые не позволят человеку
					столкнуться с другой машиной. Автомобиль не испытывает
					негативных чувств и лишен нетерпения в отличие от человека.
					Сейчас беспилотными машинами не пользуются массово, но мир
					технологий развивается и шагает семимильными шагами, поэтому
					мы наблюдаем и ждем изменений.
				</p>
			</div>
		</section>
		<section class="section article__section">
			<h2 class="section__title">
				В чем преимущества искусственного интеллекта?
			</h2>

			<ul class="list">
				<li class="list-item list__list-item">
					<h3 class="list-item__title">
						1. Системность и отсутствие ошибок.
					</h3>
					<p class="list-item__text">
						Умная программа отбирает материал за несколько секунд.
						Структурирует, выделяет главное и второстепенное. Если
						человеку нужно подумать, то машина действует безошибочно
						благодаря алгоритму.
					</p>
				</li>
				<li class="list-item list__list-item">
					<h3 class="list-item__title">2. Спасение жизней.</h3>
					<p class="list-item__text">
						При угрозе жизни человека машина берет весь удар на
						себя. Она незаменима в зонах стихийных бедствий и
						военных действий. Используется и при низких температурах
						на Севере, и при высоких на Юге.
					</p>
				</li>
				<digest-card class="list__digest-card" />
				<li class="list-item list__list-item">
					<h3 class="list-item__title">3. Работа без перерыва.</h3>
					<p class="list-item__text">
						Искусственный интеллект не устает. Он может принимать и
						обрабатывать информацию в режиме 24/7. В сфере
						обслуживания искусственный интеллект отвечает на запросы
						и решает проблемы клиентов, выполняет работу
						колл-центра. Чат – боты ведут беседы, распознают
						намерения звонящего, задают вопросы и отвечают на них.
					</p>
				</li>
				<li class="list-item list__list-item">
					<h3 class="list-item__title">
						4. Эмоциональное спокойствие.
					</h3>
					<p class="list-item__text">
						В любой работе есть проблемы: недовольства, жалобы,
						обвинения, оскорбления. Из-за трудностей человек
						испытывает негативные эмоции и не всегда с ними
						справляется в отличии от искусственного интеллекта. Чат
						– бот отвечает на запросы в корректной форме, устраняет
						негатив и дает нужные советы.
					</p>
				</li>
				<li class="list-item list__list-item">
					<h3 class="list-item__title">5. Правильность решений</h3>
					<p class="list-item__text">
						Машина работает в тысячи раз эффективнее, чем человек.
						Искусственный интеллект собирает данные, систематизирует
						и оформляет их. Полностью берет на себя всю отчетность.
					</p>
				</li>
				<li class="list-item list__list-item">
					<h3 class="list-item__title">6. Простота использования.</h3>
					<p class="list-item__text">
						С появлением Google-помощника и введением голосовых
						сообщений передавать информацию стало легче. Кофемашина
						сама варит кофе в указанное время, робот–пылесос
						выбирает траекторию, автокормушка выдает еду животным и
						т.д. Машины упрощают нам жизнь.
					</p>
				</li>
				<li class="list-item list__list-item">
					<h3 class="list-item__title">7. Контроль качества.</h3>
					<p class="list-item__text">
						Конвейер на большинстве производств незаменим. Но его
						неправильная работа приводит к браку. Искусственный
						интеллект анализирует полученную продукцию на конвейере.
						Это ускоряет и удешевляет процесс.
					</p>
				</li>
				<li class="list-item list__list-item">
					<h3 class="list-item__title">8.Быстрота решений.</h3>
					<p class="list-item__text">
						Искусственный интеллект – это больше, чем машина. Он
						синтезирует огромное количество информации и принимает
						правильное решение. Искусственный интеллект быстр,
						объективен и обоснован.
					</p>
				</li>
			</ul>
		</section>
		<section class="section article__section">
			<p class="section__text">
				Технологии совершенствуются, мир развивается. И современному
				человеку тоже нужно шагать вперед. Мы убедились в том, что во
				всех сферах жизни искусственный интеллект полезен и необходим.
				Его используют ученые, врачи, бизнесмены, фермеры, финансисты и
				т. д. Но что делать тем, кто хочет применить ИИ в своем деле, но
				не знает как? Ответ прост: обратиться в «Compas Pro».
			</p>
			<p class="section__text">
				Специалисты компании связываются с клиентом, узнают о его сфере
				деятельности, потребностях, пожеланиях и составляют техническое
				задание. После обсуждения объема, сроков, желаемых результатов
				рассчитывается и закрепляется стоимость проекта. Далее
				сотрудники «Compas Pro» составляют план и пошагово пишут
				программу.
			</p>
			<p class="section__text">
				За все время работы над проектом специалисты поддерживают связь
				с клиентом, отвечают на все интересующие вопросы. Менеджеры
				обсуждают особенности каждой задачи, учитывая все пожелания
				заказчика. В команде трудятся программисты, дизайнеры,
				копирайтеры.
			</p>
		</section>
		<section class="section">
			<h3 class="section__title">О компании</h3>
			<p class="section__text">
				«Compas Pro» на рынке веб консалтинга 7 лет. Включен в реестр
				аккредитованных IT компаний. Фирма создает и внедряет нейросети
				и искусственный интеллект в структуру бизнес-модели. Портфолио
				можно посмотреть на сайте.
			</p>
			<p class="section__text">
				Компания работает по следующим направлениям:
			</p>
			<ul class="list section__list">
				<li class="list-item list__list-item">
					<p class="list-item__text">
						создание маркетплейсов (они завоевывают популярность
						среди пользователей благодаря большому выбору
						предложений, простому интерфейсу и возможности
						сортировки товаров и услуг по ценам/популярности/срокам
						доставки и т.д.).
					</p>
				</li>
				<li class="list-item list__list-item">
					<p class="list-item__text">
						разработка корпоративных CRM-систем (системы незаменимы
						для торговых компаний, так как хранят информацию о
						каждом клиенте: что, когда на какую сумму купил, что еще
						планирует приобрести).
					</p>
				</li>
				<li class="list-item list__list-item">
					<p class="list-item__text">
						создание сайтов агрегатов (большой плюс в том, что на
						них заходит огромное количество людей в поиске товара
						или услуги, пользователям нравится, что все предложения
						собраны на одном ресурсе).
					</p>
				</li>
				<li class="list-item list__list-item">
					<p class="list-item__text">
						реализация лендингов (удобны для людей, так как имеют
						простую структуру, быстро загружаются, рассказывают об
						определенном товаре или определенной услуге).
					</p>
				</li>
				<li class="list-item list__list-item">
					<p class="list-item__text">
						разработка сложных сайтов для бизнеса (все зависит от
						того, чем занимается компания, какие цели она
						преследует, как строится коммуникация с
						клиентами/партнерами/поставщиками).
					</p>
				</li>
			</ul>
			<h3 class="section__subtitle">Плюсы работы с «Compas Pro»</h3>
			<ul class="list">
				<li class="list-item list__list-item">
					<h3 class="list-item__title">
						1.Команда специалистов с «горящими глазами».
					</h3>
					<p class="list-item__text">
						Компания не боится трудностей и выполнит проект любой
						сложности. Ведь нестандартные задачи – это та самая
						мотивация, которая создает еще одну ценность для любого
						бизнеса.
					</p>
				</li>
				<li class="list-item list__list-item">
					<h3 class="list-item__title">2. Уникальность компании.</h3>
					<p class="list-item__text">
						Compas Pro» – единственный сервис, который собирает
						источники. Не важно, чем вы занимаетесь – торговлей,
						маркетингом, финансами. Сайт соберет важную информацию и
						укажет ресурсы. Вам не придется тратить силы и время,
						чтобы узнать, где вышла интересующая статья или кто
						написал новую книгу по продажам в сфере сельского
						хозяйства, к примеру.
					</p>
				</li>
				<li class="list-item list__list-item">
					<h3 class="list-item__title">3. Удобство использования.</h3>
					<p class="list-item__text">
						Ресурсом пользоваться просто. Легко регистрироваться,
						легко отправлять запросы, легко находить нужную
						информацию. Вам не придется долго разбираться, как
						пользоваться сайтом, можно быстро начать работу. Со
						временем программа станет незаменимым помощником.
					</p>
				</li>
				<li class="list-item list__list-item">
					<h3 class="list-item__title">
						4. Отзывы на проблемы и обратная связь.
					</h3>
					<p class="list-item__text">
						После запуска проекта специалисты остаются на связи. Они
						обязательно ответят на все вопросы, помогут разобраться
						в том, как эффективно управлять продуктом. Если
						возникнет проблема, то вы можете оставить отзыв.
						Специалисты устранят проблему.
					</p>
				</li>
			</ul>
		</section>
	</article>
</template>

<script>
	// пока что компонент написан на жестком харде, до появляения текстового редактора
	//import { h } from '@vue/runtime-core'
	import DigestCard from "@/components/Blog/DigestCard.vue";
	export default {
		/* render() {
    
    return h('div', { class: 'article' }, [
      this.article.image ? h('img', { class: 'article__image', src: this.article.image }) : '',
      h('h1', { class: 'article__title' }, this.article.title),
    ] )
  }, */
		name: "TheArticle",
		components: {
			DigestCard,
		},
		props: {
			article: {
				type: Object,
				required: true,
			},
		},
	};
</script>

<style lang="scss" scoped>
	@import "@/assets/scss/variables";
	.article {
		display: flex;
		flex-direction: column;
		max-width: 1200px;

		&__main-image {
			width: 100%;
			min-height: 300px;
			border-radius: 1rem;
			margin-bottom: 3rem;
		}
		&__title {
			font-size: 5.4rem;
			font-weight: 600;
			margin-bottom: 5rem;
		}
		&__subtitle {
			font-size: 3rem;
			margin-bottom: 5rem;
		}
		&__section {
			margin-bottom: 4rem;
		}
	}
	.quote {
		display: flex;
		flex-direction: column;
		background: linear-gradient(
			135deg,
			rgba($primary, 0.3) 50%,
			rgba(#f4fef9, 0.3) 50%
		);

		position: relative;
		padding: 4.6rem 9rem;

		&__text {
			font-size: 3rem;
			font-weight: 500;
			text-align: center;
			margin-bottom: 3rem;
			&::before {
				content: "\201C";
				color: $primary;
				font-size: 10rem;
				position: absolute;
				top: 0;
				left: 50%;
				transform: translateX(-50%);
			}
		}
		&__cite {
			font-size: 2.2rem;
			text-align: center;
		}
	}
	.acent-block {
		font-size: 3rem;
		font-weight: 500;
		line-height: 1.5;
		padding: 2rem 0;
		border-top: 0.3rem solid $primary;
		border-bottom: 0.3rem solid $primary;
	}
	.section {
		padding: 0;

		&__title {
			font-size: 4rem;
			font-weight: 600;
			margin-bottom: 5rem;
		}
		&__subtitle {
			font-size: 3.6rem;
			font-weight: 500;
			margin-bottom: 3.8rem;
		}
		&__text {
			font-size: 2.4rem;
			line-height: 1.5;
			margin-bottom: 3rem;
			&:last-child {
				margin-bottom: 0;
			}
		}
		&__link {
			color: $primary;
			&_arrow {
				font-size: 3.5rem;
				line-height: 1;
			}
		}
		&__list {
			margin: 0 0 4rem 0;
		}
		&__acent-block {
			margin: 0 0 3.5rem 0;
		}
		&__quote {
			margin: 0 0 3rem 0;
		}
		&__group {
			margin: 0 0 3rem 0;
		}
	}
	.list {
		&__list-item {
			margin-bottom: 3rem;
			&:last-child {
				margin-bottom: 0;
			}
		}
		&__digest-card {
			margin-bottom: 3rem;
		}
	}
	.list-item {
		display: flex;
		flex-direction: column;

		&__title {
			font-size: 3rem;
			font-weight: 500;
			margin-bottom: 3rem;
		}
		&__text {
			font-size: 2.4rem;
			line-height: 1.5;
			margin-bottom: 3.5rem;
			&_style_italic {
				font-style: italic;
			}
			&:last-child {
				margin-bottom: 0;
			}
		}
	}
	.group {
		&__title {
			font-weight: 500;
			margin-bottom: 2.5rem;
		}
		&__text {
			font-size: 2.4rem;
			line-height: 1.5;
			margin-bottom: 2rem;
			&:last-child {
				margin: 0;
			}
		}
	}
</style>
