{
	"freelance": {
		"title": "Compas gooru-  парсер для фрилансеров",
		"freeperiod": {
			"title": "Для фрилансеров, которые устали мониторить телеграм чаты, группы в вк, фриланс биржы для поиска клиентов",
			"items": [
				{
					"title": "Забудь про мониторинг",
					"caption": "Парсер будет собирать все обращения в онлайн режиме."
				},
				{
					"title": "Будь первым",
					"caption": "Просто выбираешь нужную тематику и получаешь обращения у себя в личном кабинете."
				},
				{
					"title": "Никаких холодных обращений",
					"caption": "Парсер собирает по ключевым словам и пересылает сообщения от потенциальных клиентов по типу: «Ищу таргетолога». Это не спам, а ответ на запрос от потенциального клиента. Информация берется из открытых источников, из каналов телеграмма, групп вконтакте, фриланс бирж и других форумов."
				}
			]
		},
		"userproblems": [
			[
				"Малый поток клиентов по «сарафану». Работать с «холодными» заявками - нет желания. Хочется стабильного потока постоянных клиентов"
			],
			[
				"Мониторинг обращений на различных биржах съедает много времени и сил. Необходимо рассматривать запросы каждого потенциального клиента на разных ресурсах"
			],
			[
				"Большую часть времени находишься в поисках интересных задач из твоей специальности, выполнение которых уходит на второй план"
			]
		],
		"usersolutions": [
			[
				"В наш парсер уже включены все источники, где можно найти работу по твоей тематике.",
				"Ты просто забиваешь нужные тебе ключевые слова, для более точной настройки. Либо просто кликаешь на определенную тематику."
			],
			[
				"Парсер в режиме онлайн собирает в личном кабинете все обращения, как только они появились.",
				"Просто выбирай интересные задачи для тебя и откликайся.  Ты можешь вечером потратить 10-15 минут и написать всем сразу, как только появляется обращение пока заказчик «теплый»"
			]
		],
		"subscribeInvite": [
			"Больше клиентов, 10 обращений в день это 300 в месяц. Своего клиента ты точно найдешь",
			"Проще писать людям у которых уже есть запрос, чем обрабатывать холодные заявки."
		]
	},
	"busines": {
		"title": "Compas gooru - парсер для бизнеса",
		"freeperiod": {
			"title": "Для предпринимателей которые хотят быть в курсе последних событий на рынке, следить за конкурентами и новыми позициями товаров",
			"items": [
				{
					"title": "Будь в курсе всего",
					"caption": "Парсер будет собирать все необходимую тебе информацию в режиме онлайн."
				},
				{
					"title": "Выходи на новый уровень",
					"caption": "Следи за товарами или услугами конкурентов, выявляй чего не хватает на рынке и занимай нишу."
				},
				{
					"title": "Анализируй полученную информацию",
					"caption": "Получай уведомления о том что происходит с втоей сфере, или о конкурентах на рынке. Изучай их коммерческие предложения и выявляй потребности потребителя."
				}
			]
		},
		"userproblems": [
			[
				"Не успеваешь следить за изменениями на рынке, конекуренты опережают тебя в выборе и реализации услуг/товаров в вашем городе. Изучение поступлений новых позиций товаров и их ценообразование съедает много времени и сил"
			],
			[
				"Хочется делать потонцеальных покупателей - постоянными клиентами, а времени для выбора стратегии не хватает, открытые способы малоэффективны"
			],
			[
				"Просмотр и анализ сайтов ваших конкурентов и их коммерческих предложений повысит вашу узнаваемость и ценность среди клиентов"
			]
		],
		"usersolutions": [
			[
				"С нашим парсером можно просто выбрать нужный критерий (цена, название продукта) и уже анализировать полученные данные.",
				"Если у конкурентов произойдет какое-то обновление,  вы уже будете об этом знать. Так же можно мониторить закупочные цены у поставщиков. Просто получаете уведомления, когда произошли изменения по нужной позиции."
			],
			[
				"Мы экономим ваше время и вы точно не упустите важные изменения  у конкурентов и поставщиков.",
				"Наш парсер может осуществлять сбор данных даже когда вы отсутвуете в личном кабинете, сбор будет проходить в режиме оффлайн той информации, которая вам небходима."
			]
		],
		"subscribeInvite": [
			"Делай потенциальных клиентов - постоянными покупателями. Собирай всю необходимую информацию о конкурентах и их коммерческих предложениях",
			"Подбор нужных ресурсов в нужных вам категориях по которым будет осуществлен подбор необходимой для вас информации",
      "Если у конкурентов произойдет какое-то обновление,  вы уже будете об этом знать. Так же можно мониторить закупочные цены у поставщиков. Просто получаете уведомления, когда произошли изменения по нужной позиции."
		]
	},
	"blogers": {
		"title": "Compas gooru-  парсер для СМИ И БЛОГЕРОВ",
		"freeperiod": {
			"title": "Для источников которые хотят экономить свое время, находить и анализировать только нужную информацию",
			"items": [
				{
					"title": "Будь в курсе всего",
					"caption": "Парсер будет собирать все необходимую тебе информацию в режиме онлайн."
				},
				{
					"title": "Экономь свое время",
					"caption": "Не пропусти не одну действительно нужную новость, остортируй  все в личном кабинете."
				},
				{
					"title": "Анализируй полученную информацию",
					"caption": "Получай уведомления о том что происходит с втоей сфере, или о конкурентах на рынке. Изучай их коммерческие предложения и выявляй потребности потребителя."
				}
			]
		},
		"userproblems": [
			[
				"Выбираешь материалы из одного источника и после этого отбираешь вручную те, которые больше интересны и подходят по критериям"
			],
			[
				"Колличество источников может превышать 100 штук. Вероятность пропустить действительно важную новость в совокупности с человеческим фактором возрастает"
			],
			[
				"Другие парсеры не всегда эффективно справляются с подобными задачами, даже используюя другой парсер время уходят на сортировку"
			]
		],
		"usersolutions": [
			[
				"Вы потратите всего 30 минут на поиск нужной информации, список интересных материалов всегда будет отображаться в режиме онлайн в личном кабинете.",
				"С нашим парсером можно просто выбрать нужный критерий  и уже анализировать полученные данные.."
			],
			[
				"Мы экономим ваше время и вы точно не упустите важные изменения  у конкурентов и поставщиков.",
				"Наш парсер может осуществлять сбор данных даже когда вы отсутвуете в личном кабинете, сбор будет проходить в режиме оффлайн той информации, которая вам небходима."
			]
		],
		"subscribeInvite": [
			"Вы потратите всего 30 минут на поиск нужной информации, список интересных материалов всегда будет отображаться в режиме онлайн в личном кабинете.",
			"С нашим парсером можно просто выбрать нужный критерий  и уже анализировать полученные данные."
		]
	}
}
