{
	"freelance": {
		"title": "Compas gooru-  парсер для фрилансеров",
		"freeperiod": {
			"title": "Для фрилансеров, которые устали мониторить чаты в Telegram, группы “ВК” и фриланс-биржы для поиска клиентов",
			"items": [
				{
					"title": "Забудь про мониторинг",
					"caption": "Парсер будет собирать все обращения в онлайн-режиме"
				},
				{
					"title": "Будь первым",
					"caption": "Просто выбрираешь нужную тематику и получаешь обращения в своём личном кабинете"
				},
				{
					"title": "Никаких холодных обращений",
					"caption": "Парсер осуществляет сбор по ключевым словам и пересылает сообщения от потенциальных клиентов. Подобное сообщение будет выглядеть примерно так: “Ищу таргетолога”. Это не спам, а ответ на запрос. Информация берётся с открытых источников: каналов в Telegram, групп “Вконтакте”, бирж для фриланса и других похожих ресурсов."
				}
			]
		},
		"userproblems": [
			[
				"Сарафанное радио прносит мало клиентов. Работать с “холодными” заявками нет никакого желания. Хочется стабильного потока заказчиков"
			],
			[
				"Самостоятельный мониторинг заказов на различных биржах отнимает много времени и сил, так как приходится рассматривать запросы каждого потенциального клиента"
			],
			[
				"Выполнение работы уходит на второй план и качество этого выполнения проседает, потому что приходится постоянно искать новых клиентов"
			]
		],
		"usersolutions": [
			[
				"В нашем парсере уже есть все источники, по которым можно найти работу",
				"Для более точной настройки тебе нужно всего лишь ввести ключевые слова или выбрать определённую тематику"
			],
			[
				"Парсер в онлайн-режиме собирает все обращения сразу после их публикации",
				"Просто выбирай интересные задачи и откликайся на них. Ты можешь вечером написать сразу всем и потратить на это 10-15 минут, а можешь отреагировать сразу после публикации, пока заказчик “тёплый”"
			]
		],
		"subscribeInvite": [
			"10 обращений в день —  это 300 обращений в месяц. Своего клиента ты точно найдешь",
			"Проще писать людям, у которых уже есть запрос, чем обрабатывать “холодные” заявки"
		]
	},
	"busines": {
		"title": "Compas gooru - парсер для бизнеса",
		"freeperiod": {
			"title": "Для предпринимателей, которые хотят быть в курсе последних событий на рынке, не отставать от конкурентов и следить за обновлением товарных позиций",
			"items": [
				{
					"title": "Будьте в курсе всего",
					"caption": "Парсер соберёт необходимую для этого информацию в режиме онлайн."
				},
				{
					"title": "Выходите на новый уровень",
					"caption": "Оперативно отслеживайте ситуацию на рынке, выявляйте, чего не хватает, и занимайте пустующую нишу"
				},
				{
					"title": "Анализируйте полученную информацию",
					"caption": "Изучайте коммерческие предложения конкурентов и выявляйте потребности потребителей. Чтобы этот процесс был более удобным, мы настроили работу уведомлений"
				}
			]
		},
		"userproblems": [
			[
				"Изучение изменений на рынке отнимает много времени и сил , а конкуренты опережают в реализации услуг/товаров в вашем городе"
			],
			[
				"Хочется, чтобы потенциальные покупатели становились постоянными клиентами, но открытые способы по достижению этой цели малоэффективны"
			],
			[
				"Не знаете, как повысить узнаваемость своего бренда и его ценность среди клиентов"
			]
		],
		"usersolutions": [
			[
				"Наш парсер позволит вам своевременно реагировать на изменения конкурентов и узнавать полезную информацию. Вам необходимо просто выбрать нужный критерий (цена, название продукта) и анализировать полученные данные.",
				"Вы будете получать уведомления обо всем, что происходит у конкурентов. Вы узнаете о каком-либо обновлении, как только оно произойдёт."
			],
			[
				"Мы гарантируем, что вы точно не упустите важные изменения у конкурентов и поставщиков, и экономим ваше время, которое может уйти на решение более важных бизнес-задач.",
				"Наш парсер осуществляет сбор данных даже во время вашего отстутствия в личном кабинете. Чтобы получить нужную информацию, не нужно быть все время онлайн."
			]
		],
		"subscribeInvite": []
	},
	"blogers": {
		"title": "Для тех, кто хочет экономить своё время, находить и анализировать только нужную информацию",
		"freeperiod": {
			"title": "Для источников которые хотят экономить свое время, находить и анализировать только нужную информацию",
			"items": [
				{
					"title": "Будь в курсе всего",
					"caption": "Парсер будет собирать всю необходимую информацию в онлайн-режиме."
				},
				{
					"title": "Экономь свое время",
					"caption": "Ты не пропустишь ни одной важной новости и сможешь отсортировать всё в личном кабинете."
				},
				{
					"title": "Анализируй полученную информацию",
					"caption": "Получай информацию о том, что происходит с твоей сферой на рынке. Изучай коммерческие предложения конкурентов и выявляй потребности потребителя."
				}
			]
		},
		"userproblems": [
			[
				"Вручную отбираешь подходящие материалы только из одного источника"
			],
			[
				"Боишься пропустить действительно важную новость, потому что количество источников огромно, а влияние человеческого фактора никто не отменял"
			],
			[
				"Другие парсеры не всегда эффективнно справляются с подобными задачами, так как требуют дополнительных настроек"
			]
		],
		"usersolutions": [
			[
				"Ты потратишь всего полчаса на поиск нужной информации, а список необходимых материалов будет постоянно доступен в личном кабинете.",
				"Чтобы начать работу, нужно всего лишь выбрать нужный критерий. Остальное парсер сделает сам."
			],
			[
				"Мы экономим твоё время и гарантируем, что ты точно не упустишь важные изменения у конкурентов.",
				"Наш парсер работает даже во время твоего отсутствия в личном кабинете. Сбор необходимой информации проходит в офлайн-режиме."
			]
		],
		"subscribeInvite": []
	}
}
